# pandas

In [4]:
import pandas as pd
import numpy as np

# data structure

In [8]:
#dataframe table with rows+colunm 
s=pd.Series([10,20,30])
print(s)

0    10
1    20
2    30
dtype: int64

In [10]:
df= pd.DataFrame({
    "name":["pandu","devi"],
    "age":[20,20]
})
print(df)

    name  age
0  pandu   20
1   devi   20

# reading data csv

In [19]:
df=pd.read_csv(r"C:\Users\HP\python\data.csv")
print(df)

     name  age     city
0    devi   20  durgada
1  yamuna   21      kkd
2   pandu   20      kkd
3   ramya   20     tuni

# exploring data

In [21]:
df.head()

     name  age     city
0    devi   20  durgada
1  yamuna   21      kkd
2   pandu   20      kkd
3   ramya   20     tuni

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [26]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
df.dtypes

name    object
age      int64
city    object
dtype: object

In [30]:
df.name

0      devi
1    yamuna
2     pandu
3     ramya
Name: name, dtype: object

In [31]:
df[['name','age']]

     name  age
0    devi   20
1  yamuna   21
2   pandu   20
3   ramya   20

In [32]:
df.isnull()

    name    age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False